In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
import pandas as pd
from classipy_datagen import GBQDataset, KaggleDataset

In [4]:
k = KaggleDataset(1);
k.download_datasets();

g = GBQDataset(1);
g.download_datasets();

Called!
Processing DataFrame: nareshbhat/health-care-data-set-on-heart-attack-possibility heart.csv
Completed : {'nareshbhat/health-care-data-set-on-heart-attack-possibility'} {'heart.csv'}
Completed Creating Dataset | Saved @ /home/omer/code/AfroYak/classipy_datagen/raw_data/kaggle_data
Fetching : {'bigquery-public-data.austin_bikeshare'} {'bikeshare_trips'}
Processing DataFrame: bigquery-public-data.austin_bikeshare bikeshare_trips
Completed : {'bigquery-public-data.austin_bikeshare'} {'bikeshare_trips'}
Completed Creating Dataset | Saved @ /home/omer/code/AfroYak/classipy_datagen/raw_data/gbq_data

/home/omer/.pyenv/versions/3.8.12/envs/classipy_datagen/lib/python3.8/site-packages/google/cloud/bigquery/table.py:1967: FutureWarning: Using .astype to convert from timezone-aware dtype to timezone-naive dtype is deprecated and will raise in a future version.  Use obj.tz_localize(None) or obj.tz_convert('UTC').tz_localize(None) instead
  df[column] = pandas.Series(df[column], dtype=dtypes[column])

In [8]:
df_gbq = pd.read_json('../raw_data/gbq_data.json')
df_kaggle = pd.read_json('../raw_data/kaggle_data.json')

In [10]:
df_gbq.head()

                            dataset_name  ... shapiro_wilk_test
0  bigquery-public-data.austin_bikeshare  ...      1.401298e-45
1  bigquery-public-data.austin_bikeshare  ...               NaN
2  bigquery-public-data.austin_bikeshare  ...               NaN
3  bigquery-public-data.austin_bikeshare  ...               NaN
4  bigquery-public-data.austin_bikeshare  ...      1.000000e+00

[5 rows x 15 columns]

In [11]:
df_kaggle.head()

                                        dataset_name  ... shapiro_wilk_test
0  nareshbhat/health-care-data-set-on-heart-attac...  ...      5.800190e-03
1  nareshbhat/health-care-data-set-on-heart-attac...  ...      2.750313e-26
2  nareshbhat/health-care-data-set-on-heart-attac...  ...      1.857026e-19
3  nareshbhat/health-care-data-set-on-heart-attac...  ...      1.458000e-06
4  nareshbhat/health-care-data-set-on-heart-attac...  ...      5.400000e-09

[5 rows x 15 columns]

In [60]:
unique_vals = df_kaggle.n_unique_values.value_counts()

df_tmp = pd.DataFrame({'one':[{val:freq  for val,freq in unique_vals.items()}]})

In [62]:
df_kaggle.n_unique_values.value_counts()

2      4
4      2
3      2
41     1
49     1
152    1
91     1
40     1
5      1
Name: n_unique_values, dtype: int64

In [64]:
pd.DataFrame.from_dict({"unique_vals":[df_kaggle.n_unique_values.value_counts()]})

                                         unique_vals
0  2      4
4      2
3      2
41     1
49     1
1...

In [74]:
pd.DataFrame.from_dict([{'One':[2,3]}])

      One
0  [2, 3]

In [110]:
features = {
    "dataset_name": ['Something'],
    "table_name": ['ASD'],
    "column_name": ['One'],
    "label": ['Toad'],
    "unique_vals":[{val:freq for val,freq in df_kaggle.n_unique_values.value_counts().items()}]
}

In [111]:
pd.DataFrame.from_dict(features).to_json('../raw_data/test.json')

In [100]:
{val:freq for val,freq in df_kaggle.n_unique_values.value_counts().items()}

{2: 4, 4: 2, 3: 2, 41: 1, 49: 1, 152: 1, 91: 1, 40: 1, 5: 1}

In [98]:
pd.read_json('../raw_data/kaggle_data_v2.json').unique_value_counts.values[0]

{'58': 19,
 '57': 17,
 '54': 16,
 '59': 14,
 '52': 13,
 '51': 12,
 '62': 11,
 '60': 11,
 '44': 11,
 '56': 11,
 '64': 10,
 '41': 10,
 '63': 9,
 '67': 9,
 '65': 8,
 '43': 8,
 '45': 8,
 '55': 8,
 '42': 8,
 '61': 8,
 '53': 8,
 '46': 7,
 '48': 7,
 '66': 7,
 '50': 7,
 '49': 5,
 '47': 5,
 '70': 4,
 '39': 4,
 '35': 4,
 '68': 4,
 '38': 3,
 '71': 3,
 '40': 3,
 '69': 3,
 '34': 2,
 '37': 2,
 '29': 1,
 '74': 1,
 '76': 1,
 '77': 1}

In [112]:
pd.read_json('../raw_data/test.json')

  dataset_name  ...                                        unique_vals
0    Something  ...  {'2': 4, '4': 2, '3': 2, '41': 1, '49': 1, '15...

[1 rows x 5 columns]